[
  {
    "title": "Engineering Manager",
    "company": "ClickUp",
    "url": "https://clickup.com/",
    "logo": "images/clickup_app_logo.jpeg",
    "period": "Dec 2024 - Present",
    "highlights": [
      "Leading two fast-paced engineering squads, responsible for building high-impact product features at scale.",
      "Partnering with Product to shape roadmaps, triage issues, and balance delivery speed with technical quality.",
      "Building strong teams through mentoring, hiring interviews, and regular 1:1s while fostering a culture of ownership and excellence.",
      "Staying hands-on by contributing code, reviewing pull requests, and helping drive service reliability."
    ]
  },
  {
    "title": "Staff Software Engineer",
    "company": "ClickUp",
    "url": "https://clickup.com/",
    "logo": "images/clickup_app_logo.jpeg",
    "period": "Aug 2024 - Dec 2024",
    "highlights": [
      "Full-stack development within a foundational product squad, working across Angular 18+ frontends and Node.js backends with Nest+TypeScript."
    ]
  },
  {
    "title": "Senior Platform Engineer",
    "company": "Personio",
    "url": "https://www.personio.com/",
    "logo": "images/personio_logo.jpeg",
    "period": "May 2022 - Aug 2024",
    "highlights": [
      "Platform Engineering for all of Personio's Product Engineering teams. Providing Libraries & Frameworks to empower those teams and make software development even more awesome.",
      "Building dependency upgrade automations in order to reduce software staleness across an organization of more than 300 engineers. Automatic dependency upgrades for projects built with: Ruby and Kotlin.",
      "Providing Java libraries as abstractions over common and critical use-cases across the organization, such as ensuring SaaS Customer Tenancy separation, Feature Flagging functionality and test wrappers around databases and AWS resources. Technology used: Kotlin, TypeScript, Go.",
      "Maintaining a mono-repo and budding ecosystem of internal CLI tools. Built with: Go and NX."
    ]
  },
  {
    "title": "Engineering Manager",
    "company": "Teamwork",
    "url": "https://www.teamwork.com/",
    "logo": "images/teamwork_com_logo.jpeg",
    "period": "May 2021 - May 2022",
    "highlights": [
      "Built and led a new team of 6 cross-functional engineers from the ground up, providing personal as well as technical leadership while maintaining a SaaS product integrations platform.",
      "Managing the growth and direction of an engineering team, as well as individual team members.",
      "Responsible for the technical architecture behind a new series of microservices built for integrating different services into an existing stack.",
      "Worked alongside the Automations team to develop powerful workflows that customers could setup with third party services working bidirectionally."
    ]
  },
  {
    "title": "Senior Software Engineer",
    "company": "Teamwork",
    "url": "https://www.teamwork.com/",
    "logo": "images/teamwork_com_logo.jpeg",
    "period": "May 2020 - May 2021",
    "highlights": [
      "Designing and building out the software architecture for an integrations platform within a SaaS product.",
      "Maintaining Go and C# based microservices that interact via http and gRPC.",
      "Built internal Admin panel for all integrations resources at the company to simplify monitoring and management."
    ]
  },
  {
    "title": "Senior Full Stack Engineer",
    "company": "ComeOn Group",
    "url": "https://www.comeon-group.com/",
    "logo": "images/comeon_group_logo.jpeg",
    "period": "Apr 2019 - May 2020",
    "highlights": [
      "Development and maintenance of a long running Payments platform, used by multiple iGaming platforms and casinos.",
      "Event driven backend with emphasis on performance and reliability, serving hundreds of thousands of transactions every week.",
      "Delivering custom front-end application solutions, such as admin panels and in-house tools, with modern tech stacks (Angular 8+, Vue.js, Material Design, Ant Design)."
    ]
  },
  {
    "title": "Full Stack Engineer",
    "company": "Boldare",
    "url": "https://www.boldare.com/",
    "logo": "images/boldarecom_logo.jpeg",
    "period": "May 2018 - Apr 2019",
    "highlights": [
      "Development of enterprise frontend applications.",
      "Crafting high quality User Experiences.",
      "Working directly with clients to create bespoke digital products."
    ]
  },
  {
    "title": "Software Developer",
    "company": "Positive Power (defunct)",
    "url": "https://web.archive.org/web/20160322222016/http://www.positive-power.pl/",
    "logo": "images/positive_power_logo.png",
    "period": "Apr 2019 - May 2020",
    "highlights": [
      "PHP and Javascript developer working mainly with Zend Framework and Doctrine.",
      "Frontend lead for a bespoke enterprise client application including large asset management and mailing in Angular 5."
    ]
  },
  {
    "title": "Web Developer",
    "company": "Apicode",
    "url": "https://apicode.net/",
    "logo": "images/apicode_logo.jpeg",
    "period": "Apr 2016 - Jun 2017",
    "highlights": [
      "Hands on development of web client projects from genesis to delivery",
      "PHP development with a focus on Joomla and WordPress CMS platforms.",
      "Implementing performant, sleek and modern responsive designs ensuring cross browser compliance."
    ]
  }
]